In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data=pd.read_csv('/content/Add_sales_data_2018.csv')
data

           Date  Add1(in Thousands)  ...  Add5(in Thousands)  Profit(in Thousands)
0    2018-10-08              208.00  ...              215.15              4093.065
1    2018-10-05              217.00  ...              209.20              4042.448
2    2018-10-04              223.50  ...              218.20              4213.819
3    2018-10-03              230.00  ...              227.60              4391.665
4    2018-10-01              234.55  ...              230.90              4350.683
..          ...                 ...  ...                 ...                   ...
200  2017-12-14              288.00  ...              284.30              5374.105
201  2017-12-13              290.00  ...              284.45              5439.655
202  2017-12-12              298.60  ...              287.80              5545.013
203  2017-12-11              290.00  ...              298.35              5565.444
204  2017-12-08              287.55  ...              288.45              5421.842

[205 rows x 7 columns]

In [ ]:
#First of all, check whether there is any relationship between the amount
spent for advertising through five different companies and profit
generated.

In [18]:
data.corr()

                      Add1(in Thousands)  ...  Profit(in Thousands)
Add1(in Thousands)              1.000000  ...              0.991975
Add2(in Thousands)              0.990976  ...              0.999145
Add3(in Thousands)              0.986274  ...              0.993389
Add4(in Thousands)              0.976365  ...              0.993346
Add5(in Thousands)              0.976716  ...              0.993710
Profit(in Thousands)            0.991975  ...              1.000000

[6 rows x 6 columns]

From the above table its clear that amount spend through each ad company has a high positive correlation with profit. Ad company 2 has the highest correlation when compared to other companies.So from this we can conclude that as the amount spend in ad through ad companies increases, the profit also increses.

In [ ]:
#Build a regression model to predict the profit from the given data and
comment your findings on it.

In [3]:
data1=data.drop(['Add2(in Thousands)','Date'],axis=1)
data1

     Add1(in Thousands)  ...  Profit(in Thousands)
0                208.00  ...              4093.065
1                217.00  ...              4042.448
2                223.50  ...              4213.819
3                230.00  ...              4391.665
4                234.55  ...              4350.683
..                  ...  ...                   ...
200              288.00  ...              5374.105
201              290.00  ...              5439.655
202              298.60  ...              5545.013
203              290.00  ...              5565.444
204              287.55  ...              5421.842

[205 rows x 5 columns]

In [5]:
y=data1['Profit(in Thousands)']
X=data1.drop(['Profit(in Thousands)'],axis=1)

In [6]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,random_state=42,test_size=0.25)

In [7]:
from sklearn import linear_model
lr=linear_model.LinearRegression()

In [8]:
model=lr.fit(X_train,y_train)

In [9]:
predictions=model.predict(X_test)

In [10]:
print(y_test)

15     4152.066
9      4446.441
100    5131.898
132    4907.560
68     5004.282
95     4623.793
159    5384.175
162    5328.025
147    5175.051
182    5956.323
191    5780.799
164    4997.719
65     5075.858
175    5784.540
73     4936.120
152    5065.652
18     4190.965
82     5034.726
86     5015.536
143    5134.657
60     5145.131
101    5421.940
98     4569.293
30     4598.292
25     4436.321
16     4175.677
168    5616.791
195    5667.250
97     4648.834
194    5717.838
67     5001.615
120    5182.368
154    5017.503
202    5545.013
79     5013.207
69     5030.451
145    5108.626
55     4760.877
45     4606.340
84     4925.861
146    5250.788
66     5038.222
111    5491.792
153    5019.997
96     4647.356
38     4486.380
24     4435.174
139    5300.437
112    5425.190
29     4482.183
19     4193.095
178    6062.457
Name: Profit(in Thousands), dtype: float64

In [11]:
print(predictions)

[4182.72271459 4426.1011238  5038.06212842 4927.36716247 5032.39628612
 4620.15191299 5381.18847206 5316.60745881 5204.53815451 5935.91050279
 5788.47655949 4990.36718787 5058.40006565 5798.96238789 4963.3525098
 5068.96959938 4217.87761717 5054.22865839 5029.61004532 5138.7783579
 5151.27361059 5411.49229686 4561.96503369 4611.21766893 4445.26156003
 4155.78865353 5590.86767575 5686.60053886 4658.87728551 5704.07044013
 4985.03425498 5198.87837387 5033.74342627 5528.44634392 5027.24339974
 5049.37268433 5114.00702613 4727.4058958  4598.80007692 4926.00746743
 5212.85737542 5044.73898847 5513.94697171 4990.87701024 4666.01485475
 4490.30686626 4467.19745689 5274.91938195 5416.47183778 4505.53140875
 4222.99014137 6021.73360209]